In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("D:\DSBDL_pract\Pract2\StudentsPerformance_modified.csv")

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72.0,74.0
1,female,group C,some college,standard,completed,69,90.0,88.0
2,female,group B,master's degree,standard,none,90,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47,57.0,44.0
4,male,group C,some college,standard,none,76,78.0,75.0

In [4]:
data.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99.0,95.0
996,male,group C,high school,free/reduced,none,62,55.0,55.0
997,female,group C,high school,free/reduced,completed,59,71.0,65.0
998,female,group D,some college,standard,completed,68,78.0,77.0
999,female,group D,some college,free/reduced,none,77,86.0,86.0

In [5]:
data.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72.0,74.0
1,female,group C,some college,standard,completed,69,90.0,88.0
2,female,group B,master's degree,standard,none,90,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47,57.0,44.0
4,male,group C,some college,standard,none,76,78.0,75.0
5,female,group B,associate's degree,standard,none,71,83.0,78.0
6,female,group B,some college,standard,completed,88,95.0,92.0
7,male,group B,some college,free/reduced,none,40,43.0,39.0
8,male,group D,high school,free/reduced,completed,64,64.0,67.0
9,female,group B,high school,free/reduced,none,38,60.0,50.0

In [9]:
data.sample(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
604,male,group D,master's degree,free/reduced,completed,84,89.0,90.0
791,female,group D,some college,free/reduced,none,60,66.0,70.0
563,female,group D,some college,free/reduced,completed,63,80.0,80.0
594,female,group C,bachelor's degree,standard,completed,92,100.0,99.0
212,female,group C,high school,free/reduced,none,42,62.0,60.0

In [13]:
data.describe()

       reading score  writing score
count     994.000000     991.000000
mean       68.008048      69.487386
std        16.602270      29.563757
min         3.000000      10.000000
25%        58.000000      57.000000
50%        69.500000      69.000000
75%        79.000000      79.000000
max       100.000000     567.000000

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   992 non-null    object
 6   reading score                994 non-null    float64
 7   writing score                991 non-null    float64
dtypes: float64(2), object(6)
memory usage: 62.6+ KB

In [10]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     8
reading score                  6
writing score                  9
dtype: int64

In [15]:
data.shape

(1000, 8)

In [11]:
data['math score'].unique()

array(['72', '69', '90', '47', '76', '71', '88', '40', '64', '38', '58',
       '65', '78', '50', nan, '74', '73', '67', '70', '62', '63', '56',
       '81', '75', '57', '55', '53', '59', '66', '82', '77', '33', '52',
       '0', '79', '39', '45', '60', '61', '41', '49', '44', '30', '80',
       '42', '27', '43', '68', '85', '98', '87', '54', '51', '99', '84',
       '91', '83', '89', '22', '100', '96', '94', '46', '97', '48', '35',
       '34', '86', '92', '37', '28', '24', '113', '123', '?', '-89', '26',
       '334', '95', '36', '29', '32', '93', '19', '23', '8'], dtype=object)

In [17]:
data=data.drop(data[data['math score']<'0'].index)

In [18]:
data=data.drop(data[data['math score']=='?'].index)

In [19]:
data['math score']=data['math score'].fillna(method='bfill')

C:\Users\rahul patil\AppData\Local\Temp\ipykernel_22120\2910539571.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data['math score']=data['math score'].fillna(method='bfill')

In [20]:
data['math score'].isnull().sum()

0

In [21]:
data['math score'].unique()

array(['72', '69', '90', '47', '76', '71', '88', '40', '64', '38', '58',
       '65', '78', '50', '74', '73', '67', '70', '62', '63', '56', '81',
       '75', '57', '55', '53', '59', '66', '82', '77', '33', '52', '0',
       '79', '39', '45', '60', '61', '41', '49', '44', '30', '80', '42',
       '27', '43', '68', '85', '98', '87', '54', '51', '99', '84', '91',
       '83', '89', '22', '100', '96', '94', '46', '97', '48', '35', '34',
       '86', '92', '37', '28', '24', '113', '123', '26', '334', '95',
       '36', '29', '32', '93', '19', '23', '8'], dtype=object)

In [22]:
data['math score']=data['math score'].astype('int64')

In [23]:
data['math score'].describe()

count    964.000000
mean      66.556017
std       17.529384
min        0.000000
25%       57.000000
50%       66.000000
75%       77.000000
max      334.000000
Name: math score, dtype: float64

In [24]:
data.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                       int64
reading score                  float64
writing score                  float64
dtype: object

In [25]:
data['reading score'].unique()

array([ 72.,  90.,  95.,  57.,  78.,  83.,  43.,  64.,  60.,  54.,  52.,
        81.,  53.,  75.,  89.,  32.,  22.,  12.,  13.,  14.,   9.,   8.,
         7.,   6.,   4.,   3.,   5.,  34.,  11.,  nan,  56.,  61.,  73.,
        58.,  65.,  71.,  74.,  84.,  55.,  69.,  44.,  41.,  85.,  59.,
        17.,  39.,  80.,  37.,  63.,  51.,  49.,  26.,  68.,  45.,  47.,
        70.,  86.,  79.,  66.,  67.,  91., 100.,  76.,  77.,  82.,  92.,
        93.,  62.,  88.,  50.,  28.,  42.,  87.,  48.,  46.,  23.,  38.,
        94.,  97.,  99.,  31.,  96.,  24.,  29.,  40.])

In [26]:
data=data.drop(data[data['reading score']<0].index)

In [27]:
data['reading score']=data['reading score'].fillna(data['reading score'].median())

In [28]:
data['reading score']=data['reading score'].astype('int64')

In [29]:
data['writing score'].unique()

array([ 74.,  88.,  93.,  44.,  75.,  78.,  92.,  39.,  67.,  50.,  52.,
        43.,  73.,  70.,  58.,  86.,  28.,  46.,  61.,  63.,  53.,  nan,
        80.,  72.,  55.,  65.,  38.,  82.,  79.,  83.,  59.,  57.,  54.,
        68.,  66.,  62.,  76.,  48.,  42.,  87.,  49.,  10.,  34.,  71.,
        37.,  56.,  41.,  22.,  81.,  45.,  36.,  89.,  47.,  90., 100.,
        64.,  98.,  51.,  40.,  84.,  69.,  33.,  60.,  85.,  91.,  77.,
        27.,  94.,  95.,  19.,  35.,  32.,  96.,  97., 112., 114., 455.,
       567.,  99.,  15.,  30., 554.,  23.])

In [30]:
data.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                       int64
reading score                    int64
writing score                  float64
dtype: object

In [31]:
data=data.drop(data[data['writing score']<0].index)

In [34]:
data['writing score']=data['writing score'].fillna(data['writing score'].mean())

In [35]:
data['writing score']=data['writing score'].astype('int64')

In [36]:
data.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [38]:
data['gender'].replace(to_replace=['male','female'],value=[0,1],inplace=True)

C:\Users\rahul patil\AppData\Local\Temp\ipykernel_22120\305213522.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['gender'].replace(to_replace=['male','female'],value=[0,1],inplace=True)

In [39]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,1,group B,bachelor's degree,standard,none,72,72,74
1,1,group C,some college,standard,completed,69,90,88
2,1,group B,master's degree,standard,none,90,95,93
3,0,group A,associate's degree,free/reduced,none,47,57,44
4,0,group C,some college,standard,none,76,78,75

In [40]:
data['math score']=(data['math score']-data['math score'].min())/(data['math score'].max()-data['math score'].min())

In [41]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,1,group B,bachelor's degree,standard,none,0.215569,72,74
1,1,group C,some college,standard,completed,0.206587,90,88
2,1,group B,master's degree,standard,none,0.269461,95,93
3,0,group A,associate's degree,free/reduced,none,0.140719,57,44
4,0,group C,some college,standard,none,0.227545,78,75